       IDENTIFICATION DIVISION.
         PROGRAM-ID. CCPRAC00.
      ******************************************************************
      *    AUTOR:       DAVID MOYA                                     *
      *    DESCRIPCION: PRIMER PROGRAMA COBOL                          *
      ******************************************************************
       PROCEDURE DIVISION.
           DISPLAY '-------------------'.
           DISPLAY 'HOLA SOY DAVID MOYA'.
           DISPLAY '-------------------'.

           STOP RUN.
